[{"id":1,"name":"Apertura ","description":null,"responsible":null,"start":"2019-11-05 09:00:00","day":"5","time":"9:00","place":"Teatro"},{"id":2,"name":"Conferencia magistral \"Redes definidas por software\"","description":null,"responsible":"MSc. Denis Morejón López","start":"2019-11-05 09:30:00","day":"5","time":"9:30","place":"Teatro"},{"id":15,"name":"Sistema para el diagnóstico de fallos en máquinas eléctricas con terminal Android utilizando el ruido acústico del motor.","description":"En los últimos años el desarrollo de sistemas de monitoreo y diagnósticos de fallos en máquinas eléctricas juega un papel muy importante en diversos procesos industriales. En este trabajo se realiza el diseño e implementación de un sistema de adquisición de datos utilizado para la detección de fallos mediante la digitalización del ruido acústico del motor de inducción, para ello se hacen uso de un teléfono móvil inteligente con sistema operativo Android (terminal de adquisición de datos). El teléfono se encarga de obtener la señal y procesarla mediante un algoritmo de reconocimiento de patrones basado en análisis convolucional y sustracción espectral que diferencia estados sano y averiado del motor, con solo digitalizar el ruido como parámetro de información de entrada. Los resultados obtenidos son satisfactorios.","responsible":"Ing. Marcos Lázaro Álvarez Arteaga Miguel Enrique Iglesias Martínez Carlos Esono Mikó Nsing Pedro Fernández de Córdoba","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":23,"name":"TouchDCity, plataforma abierta de servicios e información para el ciudadano.","description":"TouchDCity es una plataforma de servicios e información para los ciudadanos. En la misma es posible añadir, buscar y encontrar información referente a las distintas ciudades del país y los lugares que en ellas existen. A los diferentes tipos de lugares se les pueden asociar servicios que brindan funciones añadidas a los usuarios de la plataforma. TouchDCity es una plataforma de código abierto en busca de la transparencia en el proceso de desarrollo así como maximizar las oportunidades de apoyo de la comunidad. En función de lograr el posicionamiento de información na-\ncional en la redes sociales se ha desarrollado un sistema de difusión automática de los datos hacia Twitter y Facebook. TouchDCity fue desarrollado utlizando PHP como lenguaje de programación, MySQL como gestor de base de datos, Yii PHP Framework como marco de trabajo y Leaflet para la construcción y procesamiento de los mapas con datos de OpenStreetMap. El código fuente del proyecto TouchDCity está disponible en https://github.com/daxslab/touchdcity.","responsible":"Msc. Gabriel Alejandro López López Ing. Carlos César Caballero Díaz Ing. Daniel Alejandro Rodríguez Caballero","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":22,"name":"Sistema para la creación y actualización de cuentas a los usuarios de la Red Universidad de Ciencias Médica de Villa Clara.","description":"La Universidad de Ciencias Médicas de Villa Clara cuenta con una matrícula superior a los seis mil estudiantes y más de mil quinientos trabajadores posee además con una red cableada y una inalámbrica en la que los usuarios tienen derecho a registrar dos equipos, resulta engorroso para los especialistas del nodo crear y actualizar las cuentas, por lo que se diseñó un sistema que permite realizar de manera ágil y sencilla estas acciones. OBJETIVO: Exponer las ventajas del Sistema para la creación y actualización de cuentas a los usuarios de la Red Universidad de Ciencias Médica de\nVilla Clara. MATERIALES Y MÉTODOS: Se realizó un estudio en la Universidad Médicas de Villa Clara en el período de enero de 2015 hasta la actualidad. Los métodos empleados fueron la Revisión bibliográfica, la observación. La investigación transcurrió en cinco etapas: diagnóstico, proyecto, diseño, aplicación y valoración. RESULTADOS: Fueron empleados para el diseño PHP, MySQL, HTML y JavaScript la implementación se efectuó en la propia Universidad, cuenta con 4791 usuarios.\nCONCLUSIONES: Se diseñó un Sistema para la creación y actualización de cuentas a los usuarios de la Red Universidad de Ciencias Médica de Villa Clara que brinda facilidades para crear de manera sencilla las cuentas y el registro de las MAC de los usuarios. El sistema se encuentra implementado desde hace cinco años y ha pasado por varias pruebas en las que se le han realizado modificaciones para su mejor funcionamiento.","responsible":"Ing. Yasmani Zapata Pérez Ing. Carlos Miguel Medina MSc. Nictadys Rojas Machado Dra. Rokselys Vigo Rodríguez Jani Rojas Machado","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":21,"name":"Aplicaciones móviles para la enseñanza de la historia local de Santa Clara.","description":"La transformación digital esta repercutido en la educación; en los últimos años han surgido diferentes dispositivos informáticos y se ha implementado disímiles softwares enriqueciendo los procesos de enseñanza y brindando un mayor acceso a la información. La alta penetración de la tecnología móvil y las características socio-económicas y culturales existentes en Cuba han propiciado que se empiece analizar el uso de aplicaciones móviles con fines educativos. Esta solución en el campo docente \npresenta múltiples beneficios y retos para la soberanía tecnológica. El desarrollo de aplicaciones para el sistema operativo Android puede contribuir a una informatización gradual en el sistema educacional de forma segura, pero para ello se requiere crear capacidades para producir softwares educativos bajo estándares abiertos y acorde a los procesos de enseñanza del país. Para conmemorar el 330 aniversario de la fundación de Santa Clara, la UIC, el Centro Provincial de Superación para la Cultura y la UNHIC en Villa Clara realizaron un sistema de acción conjunto para fomentar la promoción y enseñanza de la historia local de la ciudad desde el uso de las TICs. Para ellos se desarrollaron tres aplicaciones Android las cuales fueron utilizadas en diferentes acciones docentes. El presente trabajo presenta los resultados obtenido a partir de uso de estas aplicaciones en el proceso de aprendizaje. Se describen las características de los softwares diseñado y de las actividades educativas realizadas. Finalmente, se analizan los resultados del estudio de usabilidad de los softwares\ndesarrollados y su impacto en la enseñanza.","responsible":"MSc. Judiel Reyes Aguilar MSc. Hedy Águila Zamora MSc. Esther Lidia Pérez Coello MSc. Nictadys Rojas Machado","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":20,"name":"Sistema informático para la planificación y control de las Asambleas de Rendición de Cuenta del delegado de circunscripción en la provincia de Matanzas.","description":"Sistema informático para la planificación y control de las Asambleas de Rendición de Cuenta (en los adelante ARC) del delegado de circunscripción permite automatizar en gran medida la gestión realizada por el gobierno en el proceso de rendición de cuenta del delegado a sus electores, posibilitando que las estructuras de gobierno a nivel provincial y municipal, entidades administrativas y los delegados aborden la situación de los planteamientos, soluciones, respuestas, dudas y aclaraciones de cada uno de esos organismos, de modo que estén en mejores condiciones para realizar las asambleas.\nLa herramienta está orientada a diferentes perfiles de usuarios, desde el que va a explotar la herramienta hasta el administrador de sistema y los diferentes supervisores de información. El ambiente se encuentra preparado para que los usuarios colaboren según el proceso establecido para esta gestión y las actividades en las que se involucran.\nEl sistema informático permite agilizar todo el procedimiento que se realiza por los delegados en la planificación de las asambleas y luego se autoriza por la Asambleas Municipales del Poder Popular correspondientes y el envío de los partes estadísticos desde los municipios hacia la provincia y desde esta hacia la Asamblea Nacional del Poder Popular.","responsible":"Ing. Henry Ernesto Bermúdez Pérez Ing.Yeslaine Cortina Blanco","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":19,"name":"Alternativa libre para la enseñanza de la programación en 12 grado del colegio pedagógico.","description":"En la década de los 90 del siglo XX, Cuba se enfrenta a un dilema ético, “Generalizar el uso de la computación en el país, utilizando el sistema operativo Microsoft Windows 95, adquiridos sin licencia de uso” o quedarnos atrapados en el tiempo, ya que por el Bloqueo, Microsoft no puede comercializar con nuestro país. A 32 años de los inicios de la informatización en Cuba, el país cuenta con facultades de Ingeniería en Informática en todas las provincias del país, con una Universidad de las Ciencias Informáticas, con tres universidades en las que se estudia Ciencias de la Computación, no se justifica un proceso de informatización soportado sobre Software Propietario, muchos menos en la educación, enseñar programación utilizando software propietario. En el análisis realizado al Programa de la asignatura de Informática del 12mo grado, se observa que para cumplir los objetivos propuestos por el mismo se utiliza una herramienta propietaria, exactamente, Microsoft Visual Basic, contradiciendo, en parte lo regulado en el país en estos temas. Para paliar el déficit de computadoras existentes y resolver el problema de la utilización de software propietario, se propone lo siguiente: Utilización del BYOD/2, como solución a la poca existencia de equipos de computo de mesa, para el tema relacionado con los\nAlgoritmos utilizar PseInt como herramienta que permita a los estudiantes la modelación del pensamiento lógico. Para la enseñanza de un lenguaje de programación se propone a Python.","responsible":"Msc. Lino H. Rodríguez Acosta","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":18,"name":"FotoRecarga: aplicación Android para facilitar la recarga del saldo con bonos de Cubacel utilizando reconocimiento óptico de caracteres.","description":"FotoRecarga es una aplicación de código abierto para el sistema operativo Android,desarrollada para facilitar la recarga de saldo de Cubacel utilizando la cámara del teléfono para el reconocimiento óptico de caracteres. Está pensada para ayudar a las personas mayores, con discapacidad visual, o sencillamente que tienen dificultades para seguir las instrucciones que aparecen impresas en el bono de recarga de Cubacel. El código fuente de FotoRecarga está disponible en https://github.com/daxslab/fotorecarga.","responsible":"Msc. Gabriel Alejandro López López Ing. Carlos César Caballero Díaz Ing. Daniel Alejandro Rodríguez Caballero","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":17,"name":"Implementación de un sistema para la gestión de reservaciones y pedidos en restaurantes de la localidad de Pinar del Río.","description":"Debido a la demora en los servicios y la falta de organización de los restaurantes de la localidad de Pinar del Río, se plantea el diseño de un sistema con la capacidad de brindar una forma de auto-organización en clientes y personal a cargo de un restaurante. Dicha aplicación permitirá atender las reservas y pedidos con el objetivo de brindar un mejor control y servicio. El sistema estará comprendido por una aplicación web disponible para cualquier dispositivo que soporte un navegador web, la cual estará dirigida fundamentalmente a los procesos de gestión en el restaurante; así como una aplicación móvil para su uso en terminales Android. Estas aplicaciones permitirán a sus clientes, observar el menú disponible para escoger el plato de su preferencia, así como gestionar completamente su pedido; además el cliente tendrá la disponibilidad de reservar una mesa para una posterior visita al\ncentro. Todas estas facilidades con la tarea de hacer menos tediosa la hora de espera entre el pedido y la llegada del mismo, haciendo más dinámico y agradable su estadía en el restaurante.","responsible":"Ing. Susana Roig Armas MSc. Ramón Alexander Jaime Infante Ing. Reinier Martínez Fernández","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":16,"name":"Aplicaciones informáticas para el control de la producción en empresas pertenecientes a la industria ligera.","description":"Los sistemas de información juegan un papel muy importante ya que constituyen una herramienta de apoyo a los directivos en la toma de las decisiones. Los sistemas informáticos para el control productivo permiten gestionar la información de los tiempos que se han dedicado a cada tarea, los empleados que la realizaron, las unidades que se produjeron, la productividad de cada trabajador. Muchas son las empresas cubanas que tienen hoy el reto de informatizar sus procesos y que a su vez faciliten realizar las labores gerenciales de la forma más eficiente posible. La empresa de aplicaciones Informáticas Desoft tiene como objetivo desarrollar y comercializar productos y servicios informáticos integrales, asociados a las Tecnologías de la Información, contribuyendo al desarrollo sostenible de la sociedad motivo por el cual desarrolló para las empresas UEB Bellotex Eddio Tejerio y UEB TENPIEL Matanzas, ambas pertenecientes al Grupo Empresarial de la Industria Ligera,GEMPIL, sus respectivos sistemas para el control de la producción, por lo que en el presente trabajo se realiza una caracterización de los mismo.","responsible":"Ing. Karen Noris Granados Lobaina Ing. María C. Zulueta González Ing. Yeniel Cabrera Amaya Ing. Yesleinys Dueñas Real","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":14,"name":"PRICECLAB: herramienta para la evaluación del control externo de la calidad en laboratorios clínicos.","description":"Las Tecnologías de la Información favorecen la calidad, seguridad, eficiencia y productividad de los servicios de salud. Su utilización en los laboratorios clínicos modernos es una necesidad actual debido a una creciente solicitud de exámenes, nuevas prestaciones y mayores exigencias en términos de la calidad de los mismos. El objetivo del mismo es desarrollar un sistema informático que contribuya al perfeccionamiento del proceso de evaluación del control externo de la calidad\npara Laboratorios Clínicos en Pinar del Río. La investigación clasifica como de desarrollo tecnológico que define el proceso de implementación de una aplicación web a partir de la información recopilada como parte de la evaluación externa de la calidad de laboratorios clínicos en unidades del sistema provincial de salud en Pinar del Río. Se definen además las tecnologías empleadas para el diseño e implementación de la aplicación web. El sistema informático ofrece a los laboratorios la posibilidad de completar su esquema de Control Interno con una estimación objetiva de la calidad de sus procedimientos de medida. El sistema permite estimar la variabilidad interlaboratorio, así como comparar y evaluar métodos, de manera que se logre demostrar el desempeño del laboratorio y orientar sobre posibles causas de error. Como resultado de la investigación el sistema desarrollado favorece la toma de decisiones, así como, la mejora de los estándares de calidad en el proceso de control externo de los laboratorios clínicos mediante el uso de las Tecnologías de la Informática y las Comunicaciones, como parte de la Política de informatización del país.","responsible":"Ing. Yoan Carlos Trujillo Valdés Esp. Ivette González Fajardo MSc. Elena Mercedes Figueroa Cabrera","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":13,"name":"Sistema Informático para la contabilidad social en las empresas cooperativas.","description":"El Sistema de Contabilidad Social para las empresas cooperativas brinda mecanismos e\ninstrumentos de evaluación de la gestión social, que permiten el registro, medición, evaluación y presentación del impacto de su desempeño social. Sin embargo, se constató que, los documentos contables y registros primarios generados por el sistema de contabilidad social, actualmente se desarrollan manualmente y se registran en hojas de cálculo gestionadas en Excel y Access, lo que provoca que el trabajo sea muy engorroso. Ante la problemática, la autora desarrolló un sistema informático que contribuye al perfeccionamiento del Sistema de Contabilidad Social en las empresas cooperativas, facilitando una mejor gestión de la información lo que es fundamental\npara su correcto funcionamiento. Para el desarrollo de la solución, se utilizó la metodología RUP, como framework de desarrollo de aplicaciones web se utilizó Laravel 5.8, el cual utiliza el patrón de arquitectura de software Modelo Vista Controlador. Como lenguaje de programación se utilizó PHP 7.2. Como herramienta de modelado se empleó Enterprise Architect, y para el análisis y diseño el Lenguaje Unificado de Modelado. Además, se utilizó como sistema de gestión de base de datos, MySQL. En la metodología aplicada se destaca la inducción-deducción, la revisión bibliográfica, el método histórico-lógico y la entrevista a expertos.","responsible":"MSc. Elena Figueroa Cabrera Ing. Adiaris Arencibia Gómez Dra.C. Yamira Mirabal González Ing. Yoan Carlos Trujillo Valdés","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":12,"name":"Aplicaciones informáticas para la gestión del trámite otorgamiento de subsidios.","description":"El otorgamiento de subsidios es una política del estado cubano, puesta en práctica desde 2012 mediante el cual se concede a personas naturales con baja posibilidad económica, la posibilidad de realizar acciones constructivas en su vivienda. La gestión de este trámite involucra el accionar de varias entidades: Dirección Municipal de Vivienda, Dirección Municipal de Trabajo, Poder Popular Municipal, Sucursales Bancarias, Unidades de Comercio Minorista de Materiales de Construcción. Todas estas entidades gestionan y procesan su información manual lo que ha provocado demora, errores e insatisfacciones en los canales de comunicación institucionales. En aras de revertir la situación existente, en la empresa de aplicaciones informáticas DESOFT División Territorial Matanzas se construye, a partir de las solicitudes de la dirección de la dependencia interna de matanzas, así como de la dirección municipal de la vivienda las aplicaciones informáticas para gestionar el trámite de otorgamiento de subsidios en dichas entidades, según las actividades que a cada una de ellas compete. En el presente trabajo se realiza una descripción de las soluciones\ndesarrolladas por la División Territorial DESOFT Matanzas para la Dirección Municipal de la Vivienda y Gobierno Municipal.","responsible":"Ing. Karen Noris Granados Lobaina Ing. Malay Rodríguez Villar Ing. Pedro Félix Carrasco Yebra","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":11,"name":"Sistema Informático para la Gestión de Procesos comerciales en ETECSA Cienfuegos.","description":"El presente trabajo titulado “Sistema Informático para la Gestión de Procesos comercial en ETECSA Cienfuegos”, describe las diferentes etapas seguidas en el desarrollo de un sistema que permitió automatizar e integrar los procesos de la gestión del departamento Soporte y Comercial de la Empresa de Telecomunicaciones de Cuba (ETECSA), a partir de estudios realizados a dichos procesos. Una gran parte de estos se realizan una vez obtenida la información de los especialistas enviados mediante un documento Excel, los cuales para la obtención de informes se requiere de análisis de datos en varios libros de Excel. Para el desarrollo de este trabajo se utilizaron los flujos de trabajo de la metodología de desarrollo de software (RUP) con el Lenguaje Unificado de Modelado (UML). Durante el proceso de desarrollo las tecnologías de código abierto utilizadas para la implementación del sistema fueron: PostgreSQL 9.3 como sistema gestor de bases de datos, lenguaje de programación\nPython y el framework Django, como herramienta case la versión libre de Visual Paradigm. Como resultado se implementó una aplicación web que automatiza los procesos, lo que genera rapidez y exactitud con respecto a la información.","responsible":"MSc. Dailyn Sosa López Lic. Bunny Prieto Santana Ing. Roibel Gálvez González Dairon Ian Roque\nGarcía","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":10,"name":"Clasificación de parejas infértiles implementado en R con técnicas de inteligencia artificial. Redes Neuronales y Análisis de componentes principales.","description":"Introducción: La tasa de infertilidad en la población cubana se ha incrementado en los últimos años, por lo que, dentro de las prioridades del país en materia de salud, se encuentra incrementar la atención a las parejas infértiles.\nObjetivos: implementar diferentes técnicas estadísticas y de inteligencia artificial en R para clasificar las parejas infértiles y pronosticar sus posibilidades de embarazo según casos anteriores, además identificar los factores principales que afectan o favorecen las posibilidades de embarazo, para esta última tarea se utilizará el análisis de componentes principales en el propio R. Material y Métodos: Parejas atendidas en la consulta municipal de infertilidad de Cienfuegos. Las técnicas a usadas fueron redes neuronales y análisis de componentes principales.\nResultados: El presente trabajo se encuentra en proyección y diseño, aunque ya se han\nimplementado algunas pruebas piloto y de familiarización con las técnicas a emplear. Tales pruebas y primeros pasos se comentan con el uso de bases de ejemplos que contiene R. Conclusiones: Los resultados de ambas implementaciones constituyen una información valiosa para la toma de conductas con las parejas y posibles tratamientos a seguir. En primer lugar, poder clasificar las parejas infértiles y pronosticar sus posibilidades de embarazo según casos anteriores, en segundo lugar, identificar los factores principales que afectan o favorecen las posibilidades de embarazo.","responsible":"Dra. Mabel Anay Rodríguez Monteagudo Dr.C. Raidell Avello Martínez ","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":9,"name":"Gestión de indicadores en un laboratorio de pruebas de Software.","description":"El presente trabajo fue desarrollado por parte del grupo de calidad de la Empresa de Aplicaciones Informáticas Desoft Sancti Spíritus y como resultado del intenso trabajo de pruebas y revisiones de calidad de software que se han desarrollado en los últimos 3 años. El objetivo principal de la presente investigación es realizar un importante análisis de los indicadores que deben ser manejados y tenidos en cuenta en un laboratorio de pruebas de calidad de software, así como su relevancia dentro de la estrategia empresarial para mejorar la gestión interna de procesos tales como: Desarrollo de software y pruebas de software en sí. Los resultados se validan a través de una aplicación informática que gestiona y visualiza información, logrando resultados valiosos que demuestran la efectividad de los datos estadísticos recopilados para la toma de decisiones, asociados a procesos de desarrollo de software, gestión de la innovación y derivados. Esta investigación fue ampliamente aceptada por los involucrados, ya que ayuda a la mejora continua de los servicios,\nproductos y procesos internos de la empresa.","responsible":"Ing. Lian Lisette Hurtado Linares ","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":8,"name":"Análisis, diseño e implementación de un sistema de gestión y monitorización de los enlaces de conectividad de red y anclaje teléfonico.","description":"Para llevar un mejor control del registro de los enlaces de conectividad se implementó un sistema automatizado para la gestión de la información relacionada con los enlaces de conectividad de red y anclajes de conexión telefónica (Dial-Up) del nodo provincial de salud de Las Tunas. Objetivo: Diseñar un sistema de gestión de información para el registro y control de los enlaces de red y los anclajes telefónicos en el nodo provincial de salud. Metodología: Se automatizaron las funcionalidades de los enlaces de conectividad, añadiendo además un módulo para los anclajes de conexión telefónica autorizados en la provincia en la red de salud, utilizando Symfony 3.2, lenguaje de programación PHP y Javascript; MySQL 5.6 como gestor de base de datos. Se desarrolló análisis y diseño, en un proceso de ingeniería inversa, empleando la metodología RUP. Resultados: Se diseñó una herramienta informática con disponibilidad de la información de los enlaces de conectividad y gestión de los anclajes telefónicos, la cual permite exportar informes con las características de los enlaces, muestra gráficas con los tipos de enlaces (F Relay y ADSL)de las unidades conectadas, rango IP Lan y Wan, IP de navegación. Es un sistema de vigilancia de red para la administración y control de los enlaces de conectividad. Se exponen las principales características de las herramientas, tecnologías y metodología empleadas. Conclusiones: Fue implementada una aplicación web con funcionalidades que le permiten cómodamente al administrador de red gestionar el flujo de enlaces de conectividad de la red y los anclajes telefónicos.","responsible":"Elsy Expósito González, Yoel Rodríguez Espinosa, Ernesto Hisumi Saiz Cabrera y Gabriel Enrique Rodríguez González","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":7,"name":"Sistema Informático para el control de la deuda tributaria de Personas Naturales.","description":"La Oficina Nacional de Administración Tributaria tiene como uno de sus objetivos principales velar por el cumplimiento voluntario de las obligaciones fiscales por parte de los contribuyentes. La entidad, al accionar con contribuyentes morosos y deudores, debe llevar un control del seguimiento de la deuda que ellos han contraído y los estados por los que ésta va pasando. Debido al alarmante incremento de la deuda en personas naturales al Presupuesto del Estado, es insuficiente el control de esta clase de deuda por parte de los funcionarios, por lo que se hace necesario perfeccionar el subproceso control de la Deuda Tributaria a personas naturales en la Oficina Nacional de Administración Tributaria del municipio Guantánamo.\nEl presente trabajo investigativo tiene como objetivo desarrollar una aplicación web que permita mejorar el control de la deuda tributaria de personas naturales en el departamento de Gestión de la Recaudación de la Oficina Nacional de Administración Tributaria del municipio Guantánamo.\nPara lograr una mejor calidad en los resultados de la investigación del proceso a informatizar se aplicaron los siguientes métodos teóricos: análisis y síntesis; modelación, inducción y deducción e histórico y lógico; y como método empírico la observación. Además, se hizo uso de las técnicas de recopilación de información: entrevistas y revisión de documentos. Como resultado se obtiene una aplicación web que facilita el control de las obligaciones tributarias de las personas naturales de forma eficiente y segura.","responsible":"Ing. Lisandra Martínez Castro","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":6,"name":"Las redes sociales al servicio empresarial: presencia, marketing, fidelización. Experiencia de la ANEC en Granma.","description":"Las redes sociales se han convertido en una plataforma idónea para dar a conocer y aumentar la visibilidad de una marca o empresa y también, para interactuar y analizar las acciones de los clientes y seguidores de estas. En este trabajo se presenta el impacto que ha tenido la página corporativa en Facebook para fortalecer la gestión empresarial, la promoción de productos, eventos y servicios, el marketing digital, la fidelización de clientes y la visualización de los resultados corporativos de la\nAsociación Nacional de Economistas y Contadores de Cuba en Granma. Se aplicaron métodos de diseño gráfico, de imágenes y técnicas de trabajo en equipos para la creación de la página, la administración y actualización diaria de la información y la interacción con personas y organizaciones afines. Se desarrolló, además, una excelente alianza con el Centro de Información y Gestión Tecnológica de Granma, que se traduce en nuevos servicios.\n","responsible":"DrC. Yolanda Soler Pellicer Ing. Camilo Trujillo Pacheco MSc. Susana Lourdes García Guevara MSc. Carlos Alberto Sánchez Hernández","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":5,"name":"Curso a distancia. \"Auditorías del sistema integrado de Gestión con adopción del pensamiento basado en riesgos\"","description":"La necesidad de formar y recalificar auditores internos, así como de personal técnico y de dirección en temas relevantes para el sistema integrado de gestión de Refinería Cienfuegos, S.A. ha sido una constante que ha venido materializándose periódicamente a través de cursos contratados a diferentes empresas certificadoras y consultoras, con la correspondiente erogación de recursos financieros (gastos de matrícula, dietas, alojamiento y transporte) y lo más importante, el tiempo empleado por los especialistas y directivos designados para esa formación, que en ocasiones duran toda una semana o incluso más, dejando de realizar actividades clave de sus rutinas diarias.\nCon el trabajo Curso a distancia “Auditorías internas del sistema integrado de gestión con adopción del pensamiento basado en riesgos” se le da respuesta a las dos situaciones problémicas antes referidas; se diseña, prepara e imparte el curso, combinando determinadas OPORTUNIDADES DEL ENTORNO con ciertas FORTALEZAS INTERNAS significativas:\n-El curso está acreditado por la Universidad de Cienfuegos, es decir, posee legitimidad académica y garantiza un certificado de postgrado para los que lo aprueben.\n-El autor de este trabajo (instructor del curso), además de ser empleado de la Refinería, es profesor adjunto de la Universidad de Cienfuegos y posee las competencias necesarias para prepararlo e impartirlo (30 años de experiencias diseñando, administrando, auditando y mejorando sistemas de gestión); además cuenta con las experticias necesarias para operar satisfactoriamente la plataforma Moodle de cursos a distancia.\n-La organización cuenta con una red robusta multiusuario, con servidores que posibilitan la configuración y disponibilidad adecuada de la plataforma Moodle.\nFinalmente se muestran las experiencias de la primera graduación del curso: 18 egresados con elevado nivel de satisfacción. Durante 3 meses pudieron asimilar satisfactoriamente los contenidos\ndel curso, sin dejar de realizar sus tareas diarias más apremiantes. Se esbozan también otros beneficios colaterales.","responsible":"M.Sc. Lázaro M. Borroto Pérez","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":4,"name":"Encuesta Online de Satisfacción de Logística y Servicios, una apuesta para lograr la Protección al Consumidor Interno","description":"Se ha decidido llevar a cabo la investigación e implementación de esta herramienta informática encuestadora con el objetivo de determinar cómo perciben cada uno de los usuarios internos, los servicios brindados por el Departamento Logística y Servicios en la División Territorial de ETECSA en Cienfuegos. Proceso que coadyuvaría en la práctica eficiente de la Protección a los Consumidores (usuarios internos). Debido a que las antiguas encuestas de satisfacción del servicio brindado se realizaban de manera manual, con períodos largos de tiempo entre una y otra y que en ocasiones se perdían o podían dañarse los papeles al pasar el tiempo es que se decidió realizar de manera web, online, esta Encuesta de Satisfacción de Logística y Servicios. Otra de las bondades de la implementación de este tipo de software en la empresa es el uso de tecnologías libres y potenciar la migración a las mismas logrando con esto la Sobreanía Tecnológica a la que aspira nuestro país.","responsible":"Ing. Yurisdan Lopez Villa","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":3,"name":"Feria de Soluciones","description":"Pá que PARE (INVITADO)","responsible":"Ing. Eduardo Albetus Estévez","start":"2019-11-05 10:00:00","day":"5","time":"10:00","place":"Salón"},{"id":24,"name":"Sistema fractal para la representación tridimensional de la planta Capsicum Annuum L. para su uso en simuladores de robots agrícolas.","description":"Al emular la lógica de la naturaleza en un ordenador mediante el uso de programas de simulación se captura la esencia de los objetos naturales, sirviendo así como una herramienta de la ciencia, es por ello que la presente investigación centra su objetivo en diseñar un sistema que permita la representación tridimensional de la planta Capsicum Annuum L. en las diferentes etapas de su crecimiento para su uso en simuladores de robots agrícolas a partir de la teoría de la geometría fractal y Sistemas-L. Se analizaron características morfológicas de la planta y se automatizó el modelo Sistema-L Capsicum Annuum L. Como resultado se obtuvo un un sistema informático de código abierto que permite simular el crecimiento de la planta Capsicum Annuum L., así como generar reportes que muestran el comportamiento de los parámetros de crecimiento del cultivo en dicha simulación poniendo en manos de investigadores, especialistas, técnicos, productores y decisores del sector agrícola una herramienta que gestiona los principales resultados de la investigación científica realizada permitiendo aplicarlos en la práctica productiva y en la toma de decisiones. Se observa que la tendencia al futuro será desarrollar más este tipo de sistemas, incluyendo variaciones debido al ambiente y manejo.","responsible":"MSc. Yeniffer Aleida Veliz Díaz , MSc. Reynolds León Guerra ","start":"2019-11-05 11:00:00","day":"5","time":"11:00","place":"Local 1"},{"id":37,"name":"Los delitos informáticos. Propuestas para su configuración en el ordenamiento penal cubano. ","description":"La sociedad cubana experimenta un creciente desarrollo en materia de tecnologías y de acceso a Internet. Aparejado a este desarrollo los modus operandi para cometer los delitos tradicionales han evolucionado y han surgido nuevas formas delictivas relacionadas con las Tecnologías de la Información y las Comunicaciones (TIC). A partir del análisis realizado a la legislación penal cubana y otras relacionadas con las TIC, y observando las limitantes existentes en las mismas para enfrentar la criminalidad informática; esta investigación se enfoca en diseñar las pautas para la configuración de los delitos informáticos en la legislación penal cubana, cuya\nimplementación contribuya a la protección de los derechos de las personas naturales y jurídicas.","responsible":"MSc. Jeanders Silvio Hinojosa Calzada MSc. Liuver Camilo Momblanc MSc. Vladimir Naranjo Gómez","start":"2019-11-05 11:00:00","day":"5","time":"11:00","place":"Local 2"},{"id":25,"name":"Decidroid Incidencias: Aplicación móvil para la toma de decisiones. ","description":"La principal tarea del Centro de Contacto de la Empresa de Aplicaciones Informática es el servicio de soporte, a través de la aplicación web Sistema de Soporte en Línea. Decidroid Incidencia es una aplicación móvil que permite acceder a estos datos a través de la conexión Wifi, y brinda información sobre las incidencias y órdenes de servicios, estadísticas que son de interés a los directivos para la toma de decisiones, y una base de conocimiento que facilita el trabajo a los especialistas de soporte. Para su implementación se utilizó tecnologías basadas en software libre así como marcos de trabajo de probada eficiencia y actualidad. La aplicación logra disminuir el tiempo de respuesta al cliente.","responsible":"Lic. Anakarla Sotolongo Peña Ing. Yuniel García Sánchez","start":"2019-11-05 11:20:00","day":"5","time":"11:20","place":"Local 1"},{"id":38,"name":"Software Libre para proporcionar continuidad y desarrollo sostenible con seguridad.","description":"El proceso de migración a software libre en las empresas cubanas ha presentado obstáculos. El más importante: la dependencia de aplicaciones propietarias que se ejecutan en Sistemas Operativos específicos, generalmente Windows XP. La lenta respuesta en el desarrollo de nuevas aplicaciones ha mostrado a la virtualización como vía alternativa para lograr la migración, minimizando las vulnerabilidades\na la seguridad informática. La División Territorial de ETECSA en Cienfuegos ha logrado, con la virtualización, garantizar la ejecución de las aplicaciones propietarias utilizadas, y al mismo tiempo eliminar vulnerabilidades en la red informática que las estaciones, con Sistema Operativo de la Corporación Microsoft, introducían en la red. Ejecutar las aplicaciones propietarias en máquinas virtuales, demostró su eficacia, seguridad y posibilidad de aumentar las aplicaciones que pueden ser ejecutadas. Esto permite continuar la migración a software libre y eliminar las estaciones Windows de las redes informáticas.","responsible":"MSc. Erilys Montes de Oca Guevara MSc. Redeis Alonso Labrada Ing. Arsenio Mesa Álvarez","start":"2019-11-05 11:20:00","day":"5","time":"11:20","place":"Local 2"},{"id":39,"name":"La firma digital y la falsificación de documentos ","description":"La firma digital puede ser definida como una secuencia de datos electrónicos que se obtienen mediante la aplicación a un mensaje determinado de un algoritmo de cifrado de clave pública, y que equivale funcionalmente a la firma autógrafa en orden a la identificación del autor del que procede el mensaje. Desde un punto de vista material, la firma digital es una simple cadena o secuencia de caracteres que se adjunta al final del cuerpo del mensaje firmado digitalmente. La comparación de los tipos penales del derecho vigente con los del derecho alemán, que pueden ser considerados como los más desarrollados desde el punto de vista legislativo y político criminal, demuestra que el Código penal ha introducido varias disposiciones que hacen referencia al impacto de la electrónica en la vida jurídica. No obstante, sería necesaria una revisión tendente a ordenar conceptualmente esta materia, dado que la regulación actual, que no parece haber estado precedida de una discusión suficiente, no responde a conceptos claros ni a una visión sistemática de los problemas. La introducción de normas que regulan la firma electrónica y, por lo tanto, la creación de documentos electrónicos, pone de relieve que se trata de una tarea que puede ser considerada urgente.","responsible":"Dr.C. Raidell Avello Martínez Lic. Raúl L. Avello Peña","start":"2019-11-05 11:40:00","day":"5","time":"11:40","place":"Local 2"},{"id":26,"name":"Despliegue de servicios basados en código abierto en el sector empresarial del territorio.","description":"En las empresas del territorio ha sido marcado el uso de software propietario para configurar la mayoría de los servicios que son necesarios para la actividad diaria de las misma en correspondencia a su infraestructura de red; el uso de herramientas de código abierto era muy limitado, muchas veces por desconocimiento o porque la configuración de algunos servicios en código abierto era muy engorrosa y más difícil que si se usaban herramientas propietarias.\nComunidades de tecnología de código libre han desarrollado herramientas que facilitan el trabajo de configuración y administración de muchos servicios de red como son los casos de samba4 como controlador de dominio al estilo de Windows Server 2003 o superior, Zimbra como servidor de correo con las mismas funcionalidades que un Microsoft Exchange y Proxmox como herramienta de virtualización. Para el tema de la ciberseguridad han surgido un grupo de herramientas de gestión unificada de amenazas conocida por sus siglas en ingles UTM, donde se destaca la distribución Pfsense basada en FreeBSD que ofrece varias funciones de seguridad. El equipo en Administración de Redes de la Empresa de Aplicaciones Informática (DESOFT) se trazó como objetivo desplegar estas nuevas tecnologías en varias empresas del territorio a través de asesorías, cursos de capacitación y soporte técnico, donde se ha logrado tener un gran número de ellas migradas a esa plataforma y capacitado a su personal, manteniendo para su sostenibilidad en el tiempo un servicio de soporte que permite actualizar nuevos cambios o solucionar problemas puntuales.","responsible":"MSc. Eduardo Miranda Hidalgo Ing. Leosdani Batista Batista Ing. Yunier Arcelio Pérez Tamayo Ing. Michel Ávila Rosales Ing. José Manuel Cabrera Gutiérrez","start":"2019-11-05 11:40:00","day":"5","time":"11:40","place":"Local 1"},{"id":27,"name":"CreDes: Herramienta digital para valoración de crecimiento y desarrollo en el paciente pediátrico.","description":"Introducción: El crecimiento y el desarrollo de los infantes son indicadores mundiales de calidad de vida. La agilidad y eficacia que le brinda a parámetros útiles y de uso diario las aplicaciones androides, las hacen de vital importancia en la actualidad para una buena atención integral al niño.\nObjetivo: Confeccionar una herramienta digital, en forma de aplicación androide, para valoración del crecimiento y desarrollo psico-motor del paciente de la primera infancia.\nMétodos: Se realizó un estudio de los pacientes de 0-2 años que ingresaron desde sept/2018 a enero/2019 en el Servicio de Neumología en el Hospital Pediátrico ̈Pepe Portilla ̈. Se consultaron para ello las Historias Clínicas correspondientes indispensables para el apoyo teórico del informe final del producto terminado. Se diseñó una aplicación en lenguaje de programación Java, sobre Android Studio 1.1.0.\nResultados: La aplicación androide consta con parámetros para valorar el crecimiento y desarrollo: cálculo de peso, talla y circunferencia cefálica ideales para la edad del niño, su valoración nutricional y el avance psico-motor, mes por mes, además de brindar información sobre alimentación complementaria. El producto ha sido adecuado para hacer de la práctica diaria con estos indicadores, un trabajo más ágil y eficiente, además de su utilidad en la docencia. Conclusiones: La aplicación Androide para dispositivos móviles ̈CreDes ̈ constituye hoy una opción práctica y efectiva para valorar el crecimiento y desarrollo en los pacientes pediátricos y consultar\ninformación relacionada, lo cual justifica su empleo racional en la asistencia médica pediátrica.","responsible":"Ing. Alejandro Pelaez Batista Dra. Adriana Fonte Preciado","start":"2019-11-05 12:00:00","day":"5","time":"12:00","place":"Local 1"},{"id":40,"name":"Ciberseguridad en la protección de infraestructuras críticas eléctricas. ","description":"La ciberseguridad en las infraestructuras críticas supone hoy en día un reto fundamental para cualquier organización que las posea ante el incesante aumento de ciberataques en todo el mundo. En una realidad tecnológica como la actual, en la que los dominios físico y lógico son cada vez más interdependientes, esta tarea es todavía más necesaria pues las acciones en cualquiera de estos ámbitos pueden acarrear consecuencias devastadoras en ambos. Más importante aún en el caso de infraestructuras criticas vinculadas al sector energético, pues de su correcto funcionamiento dependen el resto de los servicios vitales con que cuenta una nación. La protección de las infraestructuras críticas eléctricas adquiere una especial importancia pues la energía eléctrica constituye el motor impulsor del resto de las actividades económicas y sociales del país. La legislación cubana actual sobre ciberseguridad y protección física garantiza, hasta un punto, la protección de estas infraestructuras, pero existe mucha dispersión legislativa al respecto, al no disponerse de una norma jurídica específica con este objetivo, en concordancia con los estándares internacionales vigentes y en relación con la realidad cubana actual.","responsible":"MSc. Jeanders Silvio Hinojosa Calzada","start":"2019-11-05 12:00:00","day":"5","time":"12:00","place":"Local 2"},{"id":28,"name":"Cuban Opensource como plataforma para la divulgación del software de código abierto echo en Cuba.","description":"Cuban Opensource es una lista de proyectos de código abierto recolectada mediante los aportes de la comunidad. El proyecto se ha difundido mediante el boca a boca y el trabajo de comunicación via correo electrónico, utilizando direcciones obtenidas mediante el scrapping de información pública en repositorios de código abierto. El objetivo es poder conocer quién está desarrollando qué en Cuba así como de unir a los desarrolladores cubanos en un espacio común. La lista está alojada en https://github.com/cuban-opensourcers/cuban-opensource.","responsible":"Msc. Gabriel Alejandro López López Ing.Carlos César Caballero Diaz Ing.Daniel Alejandro Rodríguez Caballero","start":"2019-11-05 12:20:00","day":"5","time":"12:20","place":"Local 1"},{"id":41,"name":"Vulnerabilidad: amenaza latente para los sistemas informáticos.","description":"El presente trabajo está dirigido a tratar uno de los temas más sensibles en materia de ciberseguridad, se trata de las vulnerabilidades, básicamente la piedra angular puesto que suponen el origen del que derivan numerosos fallos de seguridad. ¿Qué son las vulnerabilidades del software?, ¿Quién o quienes las descubren?, ¿Qué hacer cuando se detectan?, ¿Cómo protegerse de las amenazas que suponen?, estas son algunas interrogantes que abordamos en el presente trabajo; siempre haciendo énfasis que la mejor manera para estar protegidos es mantener una actualización periódica de los sistemas, algo de vital importancia en todas las organizaciones tanto públicas como privadas, las cuales dependen de ellos, como herramienta esencial para lograr sus objetivos de negocio o para poder desarrollar las actividades en su vida cotidiana. Por lo que se recomienda la utilización de herramientas como: Nmap, el software NESSUS, Nikto las cuales debieran incluirse en el grupo de utilizadas por los administradores de redes informáticas, así como los especialistas en seguridad informática para mantener libre de cualquier amenaza los sistemas en explotación.","responsible":"Ing. Alioky Martinez hernandez, Mcs Luis Rolando Roba Iviricu","start":"2019-11-05 12:20:00","day":"5","time":"12:20","place":"Local 2"},{"id":29,"name":"ATEL","description":"Lic. Bunny Prieto Santana, Dairon Ian García Roque MSc Dailyn Sosa López","responsible":null,"start":"2019-11-05 12:40:00","day":"5","time":"12:40","place":"Local 1"},{"id":42,"name":"Módulo para la gestion de copias de seguridad en Nova 360.","description":"La información digital está en constante crecimiento y tal aumento exige grandes capacidades de almacenamiento. La computación en la nube, a través de Internet, ha facilitado el consumo de estos volúmenes de información mediante el uso de aplicaciones como OwnCloud y NextCloud. Cuba en los últimos años ha avanzado consi -\nderablemente en el uso de la Tecnologías de la Información y las Comunicaciones como parte de la estrategia de informatización de la sociedad. Con el objetivo de lograr la soberanía tecnológica, se desarrolla un proceso de migración hacia software libre en el que se emplean soluciones informáticas desarrolladas por el Centro de Software Libre, perteneciente a la Universidad de las Ciencias Informáticas. Nova 360 es una de estas soluciones; tiene como objetivos ofrecer servicios en la nube, permitir la sincronización con múltiples dispositivos de datos y compartir archivos de forma pública. Sin embargo, para realizar la gestión de sus copias de seguridad es necesario el uso de comandos en la terminal, lo cual representa una dificultad para aquellos usuarios que no tienen conocimientos avanzados de los comandos de Linux. La presente investigación tuvo como objetivo desarrollar un módulo que gestione las copias de seguridad de Nova 360, para ello se utilizaron tecnologías en su mayoría libres, diferentes patrones de diseño y la arquitectura Modelo-Vista-Controlador. Con las pruebas aplicadas se comprobó el correcto funcionamiento de Salvas, demostrando que el mismo satisface las necesidades del cliente.","responsible":"Ing. Miosotis Toledo Rodríguez Ing. Juan Alberto Pereira Delgado","start":"2019-11-05 12:40:00","day":"5","time":"12:40","place":"Local 2"},{"id":30,"name":"ALMUERZO","description":null,"responsible":null,"start":"2019-11-05 13:00:00","day":"5","time":"13:00","place":"Comedor"},{"id":31,"name":"Portal Web para la gestión de archivos históricos digitalizados","description":"La memoria de los hechos históricos sucedido en Cuba, es un tesoro invaluable que se han tratado de preservar con el paso de los años. La Oficina del Historiador y la Casa de la Nacionalidad Cubana juegan un papel protagónico en su conservación y custodia. Para ello, se archivan y digitalizan diferentes tipos de documentos entre los que cuentan: títulos de propiedad, mapas, cartas y nombramientos. Ante la gran cantidad de escritos, estas instituciones invierten mucho tiempo en su localización para la difusión y consulta pública, servicio que es requerido por investigadores,\nestudiantes y comunidad en general. Atendiendo a estas necesidades se propone como objetivo desarrollar un portal web. Para su implementación, se empleó el sistema gestor de contenido Drupal, los lenguajes PHP, JavaScript, XHTML y CSS para el estilo de las páginas, con soporte de base de datos en PostgreSQL, el entorno de desarrollo integrado NetBeans, el servidor de aplicaciones web Apache y la metodología de desarrollo SXP. La propuesta informática fue concebida para dichas instituciones en Bayamo, Granma, pero puede ser generalizada en toda la red de Oficinas de \nHistoriadores del país. En su conformación se tuvo en cuenta la organización de los documentos según su clasificación y elementos distintivos, lo que permite que con su empleo se eleve el nivel de eficiencia en el servicio de búsqueda del acervo documental.","responsible":"Ing. Leover Armando González Rodríguez MSc. Yudi Castro Blanco","start":"2019-11-05 14:00:00","day":"5","time":"14:00","place":"Local 1"},{"id":43,"name":"Aplicación de la metodología para realizar el Análisis de Riesgos de ciberseguridad. Estudio de Caso: Refinería Cienfuegos S.A.","description":null,"responsible":"MSc. Adian Alfonso Cardoso Ing. Yoeny Caballero González","start":"2019-11-05 14:00:00","day":"5","time":"14:00","place":"Local 2"},{"id":32,"name":"Aplicación web para gestionar información sobre la planificación y cumplimiento del mantenimiento y la reparación de equipos","description":"El mantenimiento a los equipos es una actividad de vital importancia; al realizarse se logra un mayor alargamiento de su vida útil. Una correcta planificación y cumplimento de esta labor evita en muchas ocasiones que se rompan de forma repentina. Dada la gran cantidad con la que cuentan muchas institución, llevar un control minucioso sobre el período que le corresponde a cada equipo, y luego de realizado, toda la información asociada al proceso, como lo es el costo por el servicio, la entidad que lo realiza, la fecha, entre otros datos, se torna engorroso. En respuesta a esto, se propuso como objetivo la realización de una aplicación web. Para su implementación se empleó la metodología de desarrollo de software XP, los framework CodeIgniter y Bootstrap, los lenguajes de programación PHP, CCS y JavaScript, el servidor de aplicaciones web Apache, el entorno de desarrollo integrado NetBeans y el\nsistema gestor de base de datos MySQL. La propuesta informática fue concebida para el Grupo Empresarial de Comercio y Gastronomía de Granma, pero puede emplearse en cualquier organismo. Con su utilización se garantiza la planificación de los mantenimientos y reparación de los equipos de manera rápida y confiable; además, se facilita el análisis de los datos de forma detallada y precisa, aspectos que fueron validados mediante el criterio recogido en una encuesta aplicada a los usuarios del sistema de esta empresa granmense.","responsible":"MSc. Yudi Castro Blanco Ing. Leover Armando González Rodríguez","start":"2019-11-05 14:20:00","day":"5","time":"14:20","place":"Local 1"},{"id":44,"name":"Procedimiento para la instalación de Sistemas Operativos utilizando Imágenes personalizadas.","description":"La presente investigación está específicamente vinculado al trabajo dentro del Departamento de Tecnología de la Información (TI), que brinda soporte técnico a las más de 600 equipos de cómputos que posee nuestra empresa. Se llevó a cabo con el objetivo de: “Implementar un procedimiento para la instalación de las PCs que sea multi-arquitectura, haciendo uso de imágenes de Disco y herramientas de software que faciliten el proceso de soporte al software de las estaciones”. Se utiliza el método empírico de la observación, teniendo como método de recopilación de información la entrevista (con especialistas de software y usuarios finales), demostrando una optimización del proceso TI, teniendo identificadas las cuestiones fundamentales a tener en cuenta para realizar una instalación.\nLos principales resultados obtenidos son: la optimización de las instalaciones de las máquinas computadoras, minimizando los tiempos de entrega y reduciendo los posibles errores de los especialistas a cargo, ya que contiene todas las aplicaciones que utilizan nuestros usuarios; la propuesta de un procedimiento para la instalación de máquinas computadoras mostrándose como herramienta metodológica para el soporte de software.","responsible":"Ing. Ledisney Hurtado Espinosa Msc. Redeis Alonso Labrada Ing. Humberto Yera Lorenso.","start":"2019-11-05 14:20:00","day":"5","time":"14:20","place":"Local 2"},{"id":45,"name":"Análisis, diseño e implementación del Imanager, Plataforma Web de gestión y monitoreo del servidor proxy.","description":"El desarrollo de las tecnologías de la información favorece el incremento de sistemas de gestión para la administración del servidor proxy de navegación, convirtiéndose estos en una herramienta de vigilancia y evaluación del uso de la red en nodos de informática de salud en Las Tunas; ayudando a la creación de estrategias para una mejor administración y flujo de la red de acuerdo a procedimientos establecidos. Objetivo: Diseñar un sistema de gestión de información capaz de recopilar de manera confiable y disponible, los datos contenidos en el servidor proxy de Linux. Metodología: Se utilizó el framework Symfony 3.2, lenguaje de programación PHP y JavaScript; MySQL 5.6 como gestor de base de datos. Se desarrolló análisis y diseño, en un proceso de ingeniería inversa, empleando la metodología RUP. Resultados: El Imanager es un sistema con interfaz web que gestiona la información del servidor proxy de Linux, mostrando un seguimiento efectivo y particular del actuar diario de cada usuario en la red. Visualiza los usuarios, computadoras, cuotas asignadas, sitios ignorados, logs, las trazas generadas por el acceso a los servicios de redes y otras funcionalidades que posibilitan obtener detalles en tiempo real de la navegación. Además permite mostrar datos estadísticos del uso de la red, con gráficas y tablas. Conclusiones: El Imanager es una solución fiable de monitorización de redes que ofrece flexibilidad propia para administrar un servidor proxy, es un sistema informativo en tiempo real, que posibilita un mejor control de la administración del servidor de navegación.","responsible":"Yoel Rodríguez Espinosa Elsy Expósito González Ernesto Hisumi Saíz Cabrera Gabriel Enrique Rodríguez González","start":"2019-11-05 14:40:00","day":"5","time":"14:40","place":"Local 2"},{"id":33,"name":"Mi B@rrio Tecnológico, por una ciudad inteligente y sostenible.","description":"Este proyecto surgió a inicios del año 2015, bajo los principios de sustitución de importaciones y soberanía tecnológica, con el objetivo principal de facilitar el acceso de la población e instituciones del sector estatal y no estatal, de una localidad del municipio de Camagüey, a servicios informáticos, datos, información y conocimientos, útiles y necesario para el quehacer diario y para el desarrollo humano, a través del uso creativo e inteligente de las TIC ́s y teniendo en cuenta la ciberseguridad de los datos e información de los usuarios e instituciones involucradas. El proyecto concibe la creación y despliegue de soluciones informáticas y facilita la integración con otras existentes o no, y en dicho contexto constituye un aporte a la informatización del municipio de Camagüey y de Cuba. Dentro del alcance y beneficiarios se encuentran cientos de ciudadanos e instituciones de sectores como: salud, educación, cultura, gastronomía y comercio, gobierno, sector no estatal, entre otras áreas de la sociedad, las cuales, no sólo informatizaron sus procesos internos sino generan información y datos útiles para el ciudadano y otras entidades, que a través de la web o del móvil se consumen los servicios. Todas las soluciones tecnológicas están basadas en plataformas de software libre. Este proyecto\nse presentó en el marco del evento y concurso lanzado por la UIC denominado “Ideas innovadoras TIC para una ciudad más sostenible” en noviembre de 2016, en el Palacio de las Convenciones y fue premiado junto con otros trabajos foráneos.","responsible":"MsC. Orlando Enrique González Cento","start":"2019-11-05 14:40:00","day":"5","time":"14:40","place":"Local 1"},{"id":34,"name":"Bache: plataforma para mapear baches en Cienfuegos.","description":"Bache es un proyecto que tiene como meta mapear los baches en Cienfuegos. Esto con el\nobjetivo de que en un futuro la información colectada apoye a la toma de decisiones en proyectos de reparación de calles y además ayude a los transportistas en sus viajes diarios permitiéndoles conocer las rutas en peor estado y evitar así transitar por ella.","responsible":"Gabriel Alejandro López López Carlos César Caballero Díaz Daniel Alejandro Rodríguez Caballero","start":"2019-11-05 15:00:00","day":"5","time":"15:00","place":"Local 1"},{"id":46,"name":"Estrategias de implementación de Buenas Prácticas para la seguridad tecnológica en infraestructuras críticas","description":"Las sociedades modernas dependen de una serie de servicios esenciales para su funcionamiento y subsistencia en la mayoría de los casos manipulados por Sistemas de Control Industrial (ISC según sus siglas en inglés) como los SCADA (por sus siglas en inglés Supervisory Control and Data Acquisition) que actualmente enfrentan múltiples amenazas. Estos sistemas forman parte de las infraestructuras críticas por lo que para su protección se toman medidas tanto para la seguridad física como tecnológica. En este trabajo se presenta una estrategia de implementación de buenas prácticas de seguridad para el cumplimiento de las normas y resoluciones vigentes en Cuba y medidas dedicadas a la protección de estos sistemas.","responsible":"Lic. Yamilé Lajos Rojas","start":"2019-11-05 15:00:00","day":"5","time":"15:00","place":"Local 2"},{"id":35,"name":"Soporte remoto a estaciones Nauta sobre Linux","description":"La solución propuesta está basada en la “Estación Nauta sobre Linux”, la cual hace posible conectar la estación a la red corporativa, sin modificar la configuración de la estación Nauta. La misma permite realizar tareas de soporte limitadas a: encender, apagar, salvar o restaurar la estación. Se presentaron incidencias específicas con la red nauta producidas por la presencia de virus informáticos, actualizaciones de la solución Nauta, entre otras, que únicamente se podían ejecutar de forma local. Por tal motivo se comenzó a investigar si era posible realizar esas actividades de manera remota desde la red corporativa, garantizando las medidas de seguridad propias de las estaciones Nauta.\n","responsible":"Ing. Arsenio Mesa Álvarez, MSc. Redeis Alonso Labrada.","start":"2019-11-05 15:20:00","day":"5","time":"15:20","place":"Local 1"},{"id":36,"name":"Establecimiento de una plataforma de comercio elctrónico en la empresa provincial de Turismo de Ciudad Santa María, soportada sobre licencia pública general (GPL).","description":"La Empresa Provincial de Turismo de Ciudad Santa María (ETCSM) cuenta con una amplia gama de productos y servicios que comercializa, de manera convencional, desde cada uno de sus establecimientos en la Ciudad de Camagüey. Estudios realizados arrojaron que la demanda de dichos productos y servicios excede las posibilidades que brinda la comercialización local de los mismos. Era requerido, en consecuencia, un mecanismo de comercialización que permitiese el aprovechamiento máximo de los ingresos potenciales, actualmente desaprovechados. De allí surge el proyecto de diseñar y desarrollar una plataforma de comercio electrónico. Dado que las limitaciones impuestas por el bloqueo norteamericano al país imposibilitan el acceso de personas cubanas a urls de productos y servicios claves de gestión de comercio electrónico, fue necesario adoptar una alternativa basada en licencias libres para desarrollar y gestionar la Tienda Virtual. En este caso que nos ocupa, se adoptó una estrategia basada en las potencialidades de los productos liberados bajo las modalidades propias de las Licencia Pública General (GPL). Es así que surge la Tienda Virtual soportada por una concepción de Software Libre a partir de la explotación de los softwares, plugins y extensiones liberados bajo licencia GPL para el Sistema de Gestión de Contenido WordPress.","responsible":"MSc. Reynier Hernández Palacios MSc. Reynaldo Alonso Reyes ","start":"2019-11-05 15:40:00","day":"5","time":"15:40","place":"Local 1"},{"id":62,"name":"Software de gestión para clínica veterinaria en Cienfuegos.","description":"En el presente trabajo se abordan los resultados de la construcción de un sistema utilizando software libre para la gestión de pacientes en la clínica veterinaria de la provincia de Cienfuegos, con el objetivo principal de informatizar los procesos de dicha entidad mediante la gestión de flujos y el almacenamiento de datos históricos. Este contiene entre sus principales funcionalidades la gestión de historias clínicas, gestión de consultas, gestión de turnos, control del flujo de pacientes, recuperación de datos históricos y presentación de información de interés a clientes. Tras la implementación del sistema se pudieron realizar análisis técnicos y estadísticos que contribuyen a mejorar la eficiencia del trabajo en la clínica, además de hacer posible la evaluación del nivel diagnóstico y terapéutico de los médicos mediante la revisión de sus actividades registradas en el sistema, junto a la eliminación de significativos cuellos de botella en el flujo de pacientes.","responsible":"Ing. Carlos César Caballero Díaz Msc.Gabriel Alejandro López López Ing. Daniel Alejandro Rodríguez Caballero","start":"2019-11-06 09:00:00","day":"6","time":"9:00","place":"Local 2"},{"id":47,"name":"Conferencia magistral  \"Distribución de GNU/Linux Nova, una alternativa sostenible para la migración a sotfware libre\"","description":null,"responsible":"MSc. Juan Manuel Fuentes Rodríguez","start":"2019-11-06 09:00:00","day":"6","time":"9:00","place":"Local 1"},{"id":48,"name":"Subsistema Informático de provisión para el Sistema de Políticas para Entorno GNU/Linux (POL) en la DT ETECSA en Cienfuegos.","description":"El propósito principal de este trabajo es desarrollar e implementar un subsistema de provisión vía interfaz web para el Sistema de Políticas para Entorno GNU/Linux (POL); se desarrolla en la Universidad de Cienfuegos para la División Territorial de ETECSA en Cienfuegos. El sistema permite la administración, manejo y aplicación de políticas en la organización. El actual sistema POL opera exclusivamente en modo consola y desde una única estación de trabajo, la del Administrador de Red; la aplicación que se desarrolla permitirá a los ingenieros informáticos de toda la organización el manejo del sistema POL desde cualquier estación vía Web. Se utilizan como herramientas en el diseño la metodología de desarrollo de software Proceso Unificado de Desarrollo de Software (RUP), UML como lenguaje de modelado, Python como leguaje de programación y el framework Django para el módulo de Administración Web. La aplicación responde a un problema concreto del desarrollo organizacional y tiene importancia práctica.","responsible":"Ing. Paula E. Castillo Toledo MSc. Denis Morejón López \nMSc. Viviana Rosalía Toledo Rivero ","start":"2019-11-06 09:40:00","day":"6","time":"9:40","place":"Local 1"},{"id":63,"name":"ACL con SDN usando Floodlight.","description":"Las Redes definidas por software (SDN por sus siglas en inglés), es un nuevo paradigma cuya funcionalidad es simplificar la creación y gestión de las redes de computadoras. En la División Territorial de ETECSA en Cienfuegos se utiliza un sistema llamado SIUDERLAN, que se encarga de detectar y bloquear estaciones insertadas en la red LAN haciendo un escaneo cada cierto tiempo de la misma, proceso que tarda un tiempo relativamente alto entre un ciclo de escaneo y otro. El objetivo del presente trabajo es diseñar un mecanismo de control de acceso a la red del sistema SIUDERLAN de la División Territorial de ETECSA en Cienfuegos utilizando elementos de las redes definidas por software. Para ello se realiza una revisión de los controladores existentes, seleccionándose Floodlight por ser el que más se adecua a los mecanismos de listas de control de acceso (ACL por sus siglas en inglés) y el protocolo Openflow, regido por la ONF, que es la norma encargada de la estandarización de las mismas. Se selecciona Mininet como simulador para crear una red virtual a gran escala de forma rápida donde se valide el mecanismo de control de acceso utilizando SDN. Se obtiene como resultado que se aumenta la seguridad de la red, haciéndola escalable al agilizar la detección de intrusos, siendo el tiempo despreciable sin importar la extensión de la misma.","responsible":"Ing. Osniel García Hernández, Msc. Denis Morejón López","start":"2019-11-06 09:40:00","day":"6","time":"9:40","place":"Local 2"},{"id":49,"name":"Sistema de gestión de los proyectos de servicios del Centro de Información y Gestión Tecnológica de Granma","description":"El Centro de Información y Gestión Tecnológica (CIGET) de Granma, ofrece una gama de servicios en el área científico-informativa a través de proyectos, los cuales son gestionados en documentos Excel, así como la contratación, facturación y otros procesos asociados, lo que unido a otras deficiencias ralentiza su trabajo, introduce errores en los datos y por consiguiente desfavorece el proceso de la toma de decisiones en la organización. Esta investigación se enfoca en el desarrollo de una aplicación web para mejorar la gestión de la información asociada a los proyectos de servicios del CIGET de Granma, y de este modo agilizar el flujo de los datos, así como la obtención de la información precisa de forma segura, su consistencia y centralización. El proceso de desarrollo de la aplicación informática propuesta fue guiado por la metodología eXtreme Programming. Se utilizan tecnologías tales como el gestor de base de datos MySQL 5.5, los frameworks de desarrollo web Laravel 5.4 y Bootstrap 3.3, donde la técnica Ajax posibilita el intercambio de información en la mayoría de las peticiones, y las interfaces gráficas fluidas facilitan su uso en diferentes dispositivos.\nLa implantación del sistema en la entidad, significa una mejora en el manejo de la información, la obtención de estadísticas, y por tanto, en la toma de decisiones, además disminuye las cargas laborales y contribuye al aprovechamiento de la infraestructura tecnológica en la entidad, es decir, a utilizar las nuevas tecnologías en función de sus procesos de negocio.","responsible":"MSc. Omar Parada Soto Ing. Yosbany Zamora Castro Ing. Camilo Trujillo Pacheco","start":"2019-11-06 10:00:00","day":"6","time":"10:00","place":"Local 1"},{"id":64,"name":"Sistema de control de la estrategia de desarrollo para la Empresa Agroforestal Granma y el cumplimiento de sus contratos","description":"En las empresas contemporáneas, las aplicaciones encargadas de divulgar y gestionar las actividades del proceso de marketing han alcanzado un gran desarrollo por su vital importancia para elevar la calidad en las producciones. En la presente investigación se detectan deficiencias en el control a los procesos de gestión de la producción en la Empresa Agroforestal Granma que no garantiza los niveles adecuados en la eficiencia y eficacia de los resultados para cumplir con los contratos al cliente y la correcta proyección y mejora del proceso.Se desarrolla un sistema programado con herramientas de código abierto que da solución al control de los procesos de gestión de marketing como apoyo a la toma de decisiones en la Empresa Agroforestal Granma que incluye la implementación de un modelo estadístico que facilita, de manera inmediata, comparar y evaluar el perfil estratégico de cada empresa forestal y confrontarla con el estándar cubano e internacional, visualizando el perfil gráficamente. El sistema brinda a la entidad forestal la sugerencia de estrategia a seguir para mejorar los indicadores que le permitirán cumplir con los modelosdefinidos y los contratos de los clientes.","responsible":"Dra.C. Yolanda Soler Pellicer Ing. Camilo Trujillo Pacheco MSc. Susana Lourdes García Guevara ","start":"2019-11-06 10:00:00","day":"6","time":"10:00","place":"Local 2"},{"id":50,"name":"Sistema de gestión del transporte de carga automotor Zafiro. ","description":"Las empresas del transporte automotor cubanas invierten recursos y tiempo, en la selección e implementación de soluciones empresariales informáticas diseñadas para el sector. La diversidad de estas tecnologías, la falta de integralidad y la ausencia de estándares en las mismas, representan dificultades a la hora de implementarlas.\nEl presente trabajo propone un sistema de planeación de los recursos empresariales que organice integralmente la tecnología, la economía y los recursos humanos de estas empresas; la factibilidad de su uso quedó demostrada en la aplicación durante el periodo Enero/2012 hasta Noviembre/2019 en la Empresa de Cargas por Carretera\nEMCARGA y sus 18 UEB distribuidas en todo el país. Esta solución garantizó un flujo eficiente de información y proporcionó datos de una manera confiable y oportuna para la toma de decisiones. Constituyó un avance significativo en la calidad y rapidez de la gestión y control de los procesos productivos y tecnológicos, garantizando la independencia tecnológica del sector al utilizar software libre.","responsible":"MSc. Eidel Ernesto Miranda del Sol. ","start":"2019-11-06 10:20:00","day":"6","time":"10:20","place":"Local 1"},{"id":65,"name":"Aplicación Android para la gestión y visualización de la Oficina de Orientación y Consulta a la Población del Centro Histórico de la Ciudad de Camagüey (Gobierno Electrónico).","description":"El Centro Histórico de la Ciudad de Camagüey fue declarado Monumento Nacional en el año 1980 y es considerado el más extenso del país. Su núcleo más antiguo es Patrimonio Cultural de la Humanidad desde el año 2008. Este reconocimiento hace que la preservación y conservación de los valores autóctonos sea objeto de un minucioso seguimiento por la Oficina de Orientación y Consulta a la Población del Centro Histórico. Dicha oficina no dispone del reconocimiento adecuado por parte de la población que en muchos casos desconoce la existencia de la misma y cuáles son sus funciones. Lo anteriormente descrito da lugar a la situación problemática y se define como problema a resolver de la presente investigación: ¿Cómo contribuir a la gestión y visualización de la Oficina de Orientación y Consulta? Y para darle solución se define como objetivo general: Desarrollar una aplicación Android de código abierto que facilite la gestión y visualización de la oficina e insertarla en la categoría de\nGobierno Electrónico, que no es más que una herramienta de enorme potencial en términos de la Administración Pública y la gestión democrática. Esta aplicación automatizará el manejo de los trámites y solicitudes, así como brindar la posibilidad de obtener informaciones de interés para los usuarios, mostrar la ubicación de la oficina y la vivienda del ciudadano en un mapa haciendo uso del GPS del dispositivo y otras funcionalidades.","responsible":"Ing. Orlando Peña Fernández MSc. Reynaldo Alonso Reyes","start":"2019-11-06 10:20:00","day":"6","time":"10:20","place":"Local 2"},{"id":51,"name":"Plataformas para la Internet Cubana","description":"Los avances tecnológicos actuales han permitido mejorar, aceleradamente, los estilos de vida adoptados por el hombre. El crecimiento de las comunicaciones móviles ha sido\nglobal y vertiginoso, los usuarios demandan más y mejores servicios, convirtiéndose en una herramienta necesaria para las personas. Como parte del proceso de informatización de la sociedad cubana y a partir de acuerdos tomados en el Consejo de Ciberseguridad, coordinado por el Ministerio de las Comunicaciones de Cuba, se inicia el desarrollo en septiembre de 2017 de tres nuevos proyectos adicionales al Macroproyecto REDCUBA. Han sido ejecutados entre la Empresa de las Telecomunicaciones de Cuba (ETECSA) y la Universidad de las Ciencias Informáticas (UCI) conocidos como:\n1. Centro de Aplicaciones para Android. Apklis, capaz de ofrecer un servicio oficial y confiable para la distribución, actualización y moderación de aplicaciones cubanas y foráneas.\n2. Plataforma de Gestión de Contenidos Audiovisuales. Picta, como un espacio para publicar materiales audiovisuales a través de servicios de video bajo demanda, desde la red nacional.\n3. Plataforma Cubana de Mensajería Colaborativa. toDus, facilitando la comunicación entre cubanos y con los cubanos.\n","responsible":"MSc. Yaiselis Ramírez Mastrapa MSc. Allan Pierra Fuentes Ing. Rafael Alexander Mendoza Fernández ","start":"2019-11-06 10:40:00","day":"6","time":"10:40","place":"Local 1"},{"id":66,"name":"Siuderlan: Un sistema eficaz programado para el control de acceso y ubicación de estaciones en una red LAN. ","description":"La ubicación física de computadoras en una red informática alambrada de mediana o grandes dimensiones es una tarea de importancia vital para la seguridad de la\norganización. Generalmente lo más que se tiene es algún control sobre los nombres de las estaciones de trabajo, su dirección IP, o incluso el identificador de su tarjeta de red, pero estos datos muchas veces no se adquieren de forma automática por lo que es difícil mantenerlos con fidelidad. Tampoco son perdurables en el tiempo, no se pueden obtener de la máquina de un visitante o agresor, y no son concluyentes a la hora de reportar desde qué local o puesto de trabajo se efectuó un evento de seguridad o alguna anomalía generada por un usuario que esté afectando el correcto funcionamiento del resto de los servicios informáticos. En el presente trabajo se desarrolla un sistema para ubicar en el cableado estructurado de la red los equipos que se insertan en la misma. Está generalizado en varias divisiones territoriales de\nETECSA y con excelentes resultados.\n","responsible":"Ing. Jesús Alberto Leandro León Msc.Denis Morejón López","start":"2019-11-06 10:40:00","day":"6","time":"10:40","place":"Local 2"},{"id":52,"name":"Sistema para la gestión de ventas en la Empresa Cemento Sancti Spíritus. ","description":"La empresa de Cemento de Sancti se dedica a producir y vender los diferentes surtidos de cementos. El Sistema para la Gestión de producción y ventas automatiza la gestión del área de Entrega, específicamente controla las recepción y ventas de producto, incluye la lectura del visor de la pesa, gestión de conduce de recepción de materia prima, facturación de la venta de los productos, refacturación, control de los pagos, así como la generación de reportes y estadísticas basados en dicha información. Para su implementación se utilizó tecnologías basadas en software libre así como marcos de trabajo de probada eficiencia y actualidad.","responsible":"Ing. Julio Oscar Gutiérrez Martínez MSc. Niriam Ana Peña Valdés","start":"2019-11-06 11:00:00","day":"6","time":"11:00","place":"Local 1"},{"id":67,"name":"Sistema informático para la gestión de información de los profesionales pertenecientes a Educación que cumplen misiones internacionalistas (SIPME). ","description":"La historia de la solidaridad y la colaboración de nuestro pueblo en el ámbito educacional es parte fundamental de la política exterior de la Revolución Cubana. Esta investigación radica en el desarrollo de un software que garantice la gestión de la información de los profesionales pertenecientes a educación que cumplen misiones internacionalistas. El sistema fue implementado con herramientas de software libre usando PHP, HTML5, CSS3 y JavaScript como lenguajes de programación. También fueron usadas otras herramientas de código abierto como el framework de desarrollo Symfony y MySQL como sistema gestor de base de datos. Como resultado se obtuvo la aplicación SIPME la cual facilita el trabajo del Departamento de Relaciones Internacionales de la Dirección Provincial de Educación de Pinar del Río.","responsible":"MSc. Raidel Rodríguez Romeu Ing. Josué Licort Pita","start":"2019-11-06 11:00:00","day":"6","time":"11:00","place":"Local 2"},{"id":68,"name":"Aplicación Web para la gestión de la información de los entrenamientos de los atletas de Marcha Deportiva.","description":"La Escuela de Iniciación Deportiva (EIDE) Osmany Arenado, en la Provincia de Pinar del Río, tiene entre sus directrices, el perfeccionamiento constante del control de los entrenamientos deportivos. En este sentido es importante destacar que la Marcha Deportiva presenta dificultades en el almacenamiento de los resultados deportivos de los atletas de esta rama en la provincia, lo cual atenta contra la posibilidad de realizar estimaciones de la futura evolución o declive del marchista. Con el objetivo de contribuir a erradicar esta problemática, se construyó un equipo de trabajo que capturase las necesidades de funcionamiento requeridas por los usuarios, contextualizando la situación de los entrenamientos de la Marcha Deportiva y su implicación con el desarrollo de las nuevas tecnologías. Como resultado se diseña e implementa una aplicación web, desarrollada utilizando como lenguaje de programación php, como framework de desarrollo Symfony y como gestor de base de datos MySQL, que permite la gestión más eficiente de los entrenamientos de los atletas de la Marcha Deportiva, alcanzando un importante aporte a la gestión informatizada de los mismos, así como a la consecución de reportes que permitan evaluar la evolución de los atletas.","responsible":"MSc. Darielys Hernández Mitjans Ing. Daymara Domínguez Rodríguez","start":"2019-11-06 11:20:00","day":"6","time":"11:20","place":"Local 2"},{"id":53,"name":"Protocolo de Migración a LibreOffice. ","description":"Una suite de oficina es un componente integral de cualquier proceso de trabajo, ya sea personal u organizacional, y como tal es esencial para la productividad de la mayoría de los usuarios de computadoras personales. LibreOffice es un reemplazo viable para Microsoft Office, y puede reducir significativamente el costo total de propiedad de los equipos de la empresa, ya que sustituye la inversión en licencias de software por un costo de migración sustancialmente menor. La migración a LibreOffice puede convertirse en una tarea compleja para las organizaciones, debido a los problemas subyacentes reflejados en la resistencia al cambio —inherente a las dinámicas de grupos— y en la integración de la suite ofimática en la infraestructura de Tecnología Informática, que abarca el software privativo de terceros y la conversión de plantillas de documentos y macros. Por otro lado, la migración a\nLibreOffice representa una oportunidad excelente para repensar los procesos de la organización. Por ejemplo, antes de migrar las macros existentes de Visual Basic, es mejor determinar cuáles de estas siguen siendo necesarias, con el fin de descartar las que ya no se usan, y rediseñar las restantes. Lo mismo se puede aplicar a las plantillas y a los complementos privativos que conectan la suite de oficina con otras aplicaciones empresariales privativas. Este protocolo representa una referencia para las migraciones basada en las prácticas recomendadas de algunos de los proyectos más exitosos probados a nivel internacional, como la ciudad de Múnich, en Alemania; y la ciudad de Bolonia y la región de Umbría, en Italia.","responsible":"Lic. Carlos Parra Zaldivar","start":"2019-11-06 11:20:00","day":"6","time":"11:20","place":"Local 1"},{"id":54,"name":"Módulo currículo para el sistema informático integrado de la UCF.","description":"La información contenida en la hoja de currículo de un profesor como la participación de eventos, estudios realizados, proyectos en los que participa o dirige, experiencia laboral, publicaciones, permite estudiar el comportamiento de los procesos relacionados con la investigación, lograr identificar patrones en la clasificación de la ciencia con un enfoque interdisciplinar y evaluar la producción científica. El objetivo de este trabajo es la implementación de una herramienta informática para gestionar la información del currículo del personal docente de la Universidad de Cienfuegos “Carlos Rafael Rodríguez”. Para el desarrollo del módulo del sistema informático se realizó un análisis del modo en que se gestiona el currículo de los trabajadores docentes lo cual permitió lograr un mejor entendimiento del proceso para su automatización. Con los datos almacenados se podrá proporcionar un seguimiento del currículo personal y determinar si los investigadores influyen positiva o negativamente en la generación de conocimiento, permite conocer las actividades\ndel personal docente, otorgado disponibilidad, estructuración y actualización al currículo personal y se podrá estimar la eficiencia de la actividad de investigación desarrollo e innovación y formación doctoral. Para el desarrollo de la aplicación se utilizó PHP como lenguaje de programación, Yii framework y PorstgreSQL como gestor de base de datos y para la documentación la metodología RUP.","responsible":"MSc. Kadir Héctor Ortíz Ing. Carlos A. Socarrás Rodríguez","start":"2019-11-06 11:40:00","day":"6","time":"11:40","place":"Local 1"},{"id":69,"name":"Sistema Integral de Telecomunicaciones (PLATEL).","description":"Se especifican las generalidades del Sistema de Integral de Comunicaciones PLATEL, que es una solución de comunicaciones unificadas que integra un conjunto de tecnologías basadas en software libre, capaz de brindar los servicios de comunicación empleando como tecnología base la VoIP. Es una solución eficiente que ofrece funciones de voz, datos, mensajería de voz, sistema automatizado de respuesta, video, seguridad y tecnologías inalámbricas integradas con las aplicaciones empresariales.\nSe especifican las particularidades técnicas del sistema. Es un producto desarrollado con el empleo de tecnologías libres, escalable y modular. Solución viable que integra de forma sencilla las conexiones telefónicas tradicionales con los nuevos servicios de VoIP. Incluye un sistema de administración vía Web que permite la configuración, administración, monitoreo y control de la central telefónica. En dependencia del escenario a emplearse puede tener desde 10 hasta 1500 extensiones, soportando escenarios distribuidos o centralizados.\nSe enuncian los beneficios que proporciona el empleo de un sistema como este para la\ngestión de los Servicios Médico entre los que se encuentran:\n- Intercambio de imágenes de ultrasonidos y radiografías entre el personal médico de una institución utilizando los dispositivos móviles de los mismos sin acarrear gastos de sus saldos personales ya que emplea la conexión a la red local de computadoras de la entidad, solo necesita la existencia de una red wifi en la entidad.\n- Visualizar en un local el desarrollo de una operación en tiempo real.\n- Realización de videoconferencias de una direcciones de salud con las instituciones\nsubordinadas.","responsible":"Ing. Diango Roque Pelayo","start":"2019-11-06 11:40:00","day":"6","time":"11:40","place":"Local 2"},{"id":55,"name":"Sistema de adquisición de datos espaciales con terminal Android y almacenamiento en nube para la agricultura de precisión.","description":"El desarrollo de la Agricultura de Precisión juega un papel muy importante en un mundo donde prima cada vez más la escasez de los recursos naturales y los problemas ambientales. El uso de las técnicas de AP permitirá ahorrar de manera eficiente el consumo de recursos tan importantes como son el agua, la energía, los fertilizantes y pesticidas, aumentando la productividad y reduciendo el impacto medioambiental en nuestro país. En este trabajo se realiza el diseño e implementación de un sistema de adquisición de datos espaciales y almacenamiento en nube para la AP. Para ello se hace uso de un teléfono móvil inteligente con sistema operativo Android, un sensor externo de temperatura y humedad, y un ordenador portátil (usado para simular la nube). El teléfono se encarga de obtener latitud, longitud y altitud, con el receptor GPS que incorpora. La temperatura y la humedad la adquiere del sensor externo mediante Bluetooth. Posteriormente, se encarga de enviar toda la información a la nube simulada. La nube consta de un interfaz REST que se encarga de tramitar las peticiones y una base de datos donde se almacenan los datos. Los datos capturados se han graficado para mostrar su utilidad en la práctica sobre el terreno. Finalmente, la investigación se enfoca en una herramienta de rápida aplicación en el entorno cubano utilizando tecnologías accesibles, la cual permitirá dotar a nuestros pequeños y medianos agricultores de información para realizar un planteamiento racional de movimiento de tierras, ahorro de recursos y aumento de producciones.","responsible":"Ing. Marcos Lázaro Álvarez Arteaga Dr.C. José Raúl Vento Álvarez Ing. Francisco Javier Guembe Lara Ing. Alejandro Fernández Gil","start":"2019-11-06 12:00:00","day":"6","time":"12:00","place":"Local 1"},{"id":70,"name":"Control organizacional de la UIC Cienfuegos.","description":"La aplicación desarrollada tiene como objetivo tener un registro y control actualizado de las principales funciones de la Unión de Informaticos de Cuba en la Provincia de Cienfuegos. El sistema se encuentra instalado en un Servidor Web, el cual permite que varios usuarios puedan trabajar en el mismo momento y siempre tener una única información actualizada. Entre los registros y controles que hoy se trabajan en la aplicación están: Registro de los miembros, control de la cotización, control de la capacitación impartida a traves de la UIC y “Quien sabe Qué” Para próximas versiones se le incorporarán otras funciones como es el control y cumplimiento de acuerdos, participación en actividades y eventos, entre otras. La aplicación se puede distribuir a otras provincias ya sea montada en un servidor central o como servidores independientes.","responsible":"Ing. Lázaro Arias Acea Ing. Gisela Díaz García Ing. Liliana Llanez Robaina","start":"2019-11-06 12:00:00","day":"6","time":"12:00","place":"Local 2"},{"id":56,"name":"Experiencias de la propuesta de un curso a distancia sobre soberanía tecnológica. ","description":"La nueva Revolución educacional promueve la formación del hombre capaz de elevar su cultura digital en aras de que se comprenda que la tecnología forma parte de la vida cotidiana y se habilite la transformación digital adaptándose a los reclamos que el siglo XXI depara en cuanto al uso de las Tecnologías de la Información y la Comunicación (TIC) para la familia cubana en la Sociedad de la Información. Estos cambios requieren de una preparación urgente de los ciudadanos, fundamentalmente las personas que no nacieron ni crecieron con las tecnologías.\nEn la actualización de la política de informatización cubana, la alfabetización digital es una de las prioridades de elevar la cultura informática para apoyar y entender el desafío que impone el uso de las TIC para la familia cubana. Resulta urgente que se priorice el tema de la soberanía tecnológica, en un entorno condicionado a nivel mundial por el ciberespionaje y por el control de las grandes transnacionales de las Tecnologías de la Información y las Comunicaciones (TIC).\nEl presente trabajo presenta una propuesta de curso para apoyar las actividades que desarrolla Joven Club en su proyección de alfabetización digital, la cual permite la capacitación de los ciudadanos.\n","responsible":"﻿MSc. Alina Arce Coto","start":"2019-11-06 12:20:00","day":"6","time":"12:20","place":"Local 1"},{"id":71,"name":"Plataforma para el desarrollo de aplicaciones web basada en tecnologías de software libre.","description":"En la actualidad se manifiesta un incremento considerable en el desarrollo de aplicaciones web orientadas a la gestión de información. Para el desarrollo de estas aplicaciones existe una variedad de lenguajes de programación así como frameworks que facilitan la implementación de las mismas, por lo que se define mediante este trabajo una propuesta de una plataforma para el desarrollo de aplicaciones web en la División Territorial ETECSA Cienfuegos, lo que propone estandarizar el desarrollo de proyectos de baja, mediana o alta envergadura, enfocado sobre todo en tecnologías libres tanto a la hora del desarrollo como el despliegue del mismo. Esta plataforma pretende disminuir el tiempo de programación de las aplicaciones y hace más factible el soporte de los especialistas a los sistemas. Dentro de esta plataforma se propone como lenguaje de programación Python y el uso del framework Django. Para la capa de presentación se define el uso de las librerías jQuery y Bootstrap fundamentalmente y como gestor de base de datos PostgreSQL.","responsible":"Ing. Humberto Yera Lorenzo Msc. Erilys Montes de Oca Guevara Ing. Arsenio Mesa Álvarez.","start":"2019-11-06 12:20:00","day":"6","time":"12:20","place":"Local 2"},{"id":57,"name":"Implementación de una nube para Pinar del Río Ciudad Inteligente 2030.","description":"La ciudad inteligente se refiere a un tipo de desarrollo urbano basado en la sostenibilidad, que es capaz de responder adecuadamente a las necesidades básicas de instituciones, empresas, y de los propios habitantes, tanto en el plano económico, como en los aspectos operativos, sociales y ambientales. Con el propósito de gestionar los datos capturados por los dispositivos creados con placas Arduinos, en el proyecto Pinar del Río Ciudad Inteligente 2030, el siguiente trabajo consigue la implementación de una nube en Thinger.io, que es una plataforma de código abierto que puede utilizarse de manera local gracias a que permite tener sus servidores para instalarla en una máquina propia, además de que ofrecen una cuenta gratuita utilizando su infraestructura en la nube. En el trabajo podemos ver la implementación de diferentes dispositivos los cuales se utilizan para medir Calidad del Aire, Video-vigilancia y Consumo y Tensión de Corriente Eléctrica.","responsible":"MSc. Ramón Alexander Jaime Infante Dr.C. José Raúl Vento álvarez MSc. Vicente Rodríguez Benítes","start":"2019-11-06 12:40:00","day":"6","time":"12:40","place":"Local 1"},{"id":72,"name":"Herramienta informática para la conciliación de Sectores y Cuotas entre los sistemas SIPREC y SINBAD+","description":"El Aseguramiento de los Ingresos se sustenta en el monitoreo continuo de la cadena de ingresos de los servicios de telefonía básica, pública, datos e internet, con enfoque preventivo para asegurar la facturación correcta y oportuna de los servicios. Para el logro de este objetivo se realiza el Balance de las cuotas entre SIPREC y FACTURACIÓN, con lo que se garantiza que todos los servicios provisionados se cobren correctamente, pero es una tarea que de forma manual sería prácticamente imposible de realizar dada la cantidad de caracteres a comparar. Con este sistema se automatiza el trabajo que se realizaba.","responsible":"Ing. Yaniris Caridad Cabrera Abreus MSc. Erilys Montes de Oca Guevara Ing. Humberto Yera Lorenzo","start":"2019-11-06 12:40:00","day":"6","time":"12:40","place":"Local 2"},{"id":58,"name":"ALMUERZO","description":null,"responsible":null,"start":"2019-11-06 13:00:00","day":"6","time":"13:00","place":"Comedor"},{"id":59,"name":"Ecosistema tecnológico EPIA 11. Por una soberanía tecnológica y ciberseguridad.","description":"El trabajo expone las principales dificultades identificadas en la organización de la\ninformatización de los procesos, servicios y redes informáticas, así como la estrategia implementada para el logro de un ecosistema tecnológico que favorezca la gestión de proyectos y empresarial en la empresa de proyectos de ingeniería y arquitectura No. 11 (epia once); además, se realiza un análisis económico del impacto para la empresa en cuanto al ahorro de recursos financieros por la ejecución de soluciones internas, coadyuvando al principio de lograr la soberanía tecnológica y la sustitución de importaciones para alcanzar la sostenibilidad y crecimiento del sector empresarial cubano, La implementación de la estrategia, evaluada y aprobada por la dirección de la empresa, permite en un período corto de tiempo importantes resultados en la gestión de la información, de proyectos, de conocimiento, en los procesos estratégicos y de apoyo, así como en la gestión empresarial en sentido general, evidenciándose que las tecnologías de la información y las comunicaciones (TIC ́s) en función de la gestión empresarial, alineado con los objetivos empresariales, son un factor de éxito en una organización empresarial.","responsible":"MsC. Orlando Enrique González Cento, MsC. Eidel Miranda del Sol,Tec. Jose Yudier Arencibia Ajo, Arq. Cosme A. Caso Machín, Ing. Odel Morales Gómez, \nMichael Brooks Guerra, Ing. Diosbel Pérez Guevara ","start":"2019-11-06 14:00:00","day":"6","time":"14:00","place":"Local 1"},{"id":73,"name":"Herramienta web para la gestión de los traslados de activos fijos y abm usuarios.","description":"En la actualidad se manifiesta un incremento considerable en el desarrollo de aplicaciones web orientadas a la gestión de información, éstas proporcionan un mejor funcionamiento, ayudan a la toma de decisiones y al control de las organizaciones. El desarrollo de esta herramienta es de gran utilidad para el Departamento de Tecnología\nde la Información y el Departamento de Economía, así como los restantes departamentos de la Dirección Territorial ya que nos permite de forma rápida confeccionar un Movimiento de Activos Fijos Tangibles , así como la confección de los ABM (Alta, Baja, Modificaciones) de usuarios para los diferentes servicios que se brindan a los clientes internos de la empresa. Este trabajo se lleva a cabo con el objetivo de migrar hacia la plataforma de software libre la actual aplicación Web Útiles TI que presentaba vulnerabilidades que no podían ser atendidas ya que la misma se había quedado sin personal que le diera soporte. Este trabajo contribuye a la optimización del sitio, mejoras continuas en el proceso de creación del traslado de medio básico en el menor tiempo posible con un mínimo de errores.\n","responsible":"Ing. Arahit Cordero Hernández Ing. Ledisney Hurtado Espinosa Ing. Humberto Yera Lorenzo","start":"2019-11-06 14:00:00","day":"6","time":"14:00","place":"Local 2"},{"id":60,"name":"Enfoque de Marco Lógico para la toma de desiciones en el proyecto de la Distribución Cubana de GNU/Linux Nova: Un caso práctico.","description":"Debido a la facilidad para crear una distribución de linux personalizada, es que existen cientos de distribuciones Linux, cada una con características propias que la diferencia entre las demás. Algunas están orientadas para el entretenimiento del usuario y pueden incluir los programas necesarios para reproducir videos y audio en cualquier formato, otras están orientadas a los juegos, otras a la seguridad, algunas al área científica, otras a la educación, etc. Sin embargo cualquiera sea su finalidad si no es fácil de aprender, operar y ofrecer un nivel de servicio útil al usuario, entonces se verá afectada la capacidad de mantener usuarios fieles a él. En la presente investigación se utiliza el enfoque de marco lógico para localizar uno de los problemas que ha estado afectando de manera negativa la experiencia de usuario al utilizar la Distribución Cubana de GNU/Linux Nova y obtener información valiosa para que los responsables del proyecto puedan identificar áreas de mejora. Se realiza el análisis de los involucrados, se construye el árbol de problemas, se identifica el problema a resolver y las posibles alternativas de solución. Además se analiza la importancia y pertinencia del problema principal en el desarrollo de productos de software de código abierto (OSS).","responsible":"Ing. Yasmary Prieto Carmona","start":"2019-11-06 14:20:00","day":"6","time":"14:20","place":"Local 1"},{"id":74,"name":"Diseño del servicio de soporte técnico basado en la Biblioteca de Infraestructura ITILv3 para el departamento de Soporte Técnico de la XETID en Matanzas.","description":"El servicio de Soporte técnico asociado a los productos de software que comercializa la Empresa de Tecnologías de la Información para la Defensa es de vital importancia para el éxito de la organización, por lo que se necesita que el Soporte técnico se gestione eficazmente para cerrar el ciclo productivo, por lo que el presente trabajo tiene como objetivo: Diseñar el Servicio de Soporte Técnico basados en la Biblioteca de infraestructura ITILv3 en el Departamento de Soporte de la XETID en Matanzas. Para lograr este objetivo se hace necesario entender primero, y después cambiar, los procesos donde ocurren las ineficacias, defectos, baja satisfacción o el bajo ritmo de producción. De esta forma mejoraran la eficacia, la eficiencia y la flexibilidad de los servicios para que el trabajo se realice de una forma más rápida, económica y centrada en aspectos esenciales y se obtenga como resultados clientes satisfechos.","responsible":"MSc. Maikell Avilés Mariano Dr.C. Roberto C. Pons García MSc. Jacinto Torres Fernández Ing. Diango Roque Pelayo","start":"2019-11-06 14:20:00","day":"6","time":"14:20","place":"Local 2"},{"id":61,"name":"Servicios de acceso a eventos de riesgos mediante vehículos no tripulados: Q-MO.","description":"Se presenta un prototipo de vehículo no tripulado (hexápodo) para realizar evaluaciones en situaciones de riesgos. Los sensores y otros elementos que lo componen son ajustables a la situación a evaluar. El prototipo fue impreso impresora con 3D modelo Anet A8, consta de varios sensores de gases y temperatura. La placa base es ARDUINO. La comunicación con el vehículo es con dispositivos móviles con sistema operativo Android y la gestión de datos con software libre y código abierto para futuros desarrollos. Los especialistas lo valoraron en un taller con posibilidades de uso y de mejoras en función del evento a evaluar y con un costo aceptable","responsible":"Lic. Juan Carlos Gil Palomino","start":"2019-11-06 14:40:00","day":"6","time":"14:40","place":"Local 1"},{"id":75,"name":"Desarrollo del Sistema Automatizado para la Gestión Ambiental Empresarial (SAPGAE).","description":"Se analizan los riesgos de ciberseguridad en Refinería Cienfuegos S.A. mediante una tormenta de ideas que se valoran en una mesa de trabajo interdisciplinario (electricidad, automática, informática, operaciones) tanto tecnologías de la información como tecnologías de operaciones. Para ello conformamos varias preguntas para hacer mucho más flexible el desarrollo de la solución del problema planteado que nos permite encuestarlo por variables, ¿A quién afectaría?, ¿Qué podría ocurrir?, ¿Qué debilidad afectaría?, ¿Qué podría provocar?, ¿Cuánto daño podría causar?, ¿Qué tan a menudo podría ocurrir?, ¿Qué puede ser hecho?, ¿Cuál es el costo de la medida?. Se obtuvieron las variables, activo, amenaza, vulnerabilidades entre otras. Además del enfoque inicial que nos ayuda a comprender el ejercicio a realizar tenemos que tener en cuenta que como resultado final queremos conocer, ¿Cuáles son los activos más importantes?, ¿Cuáles amenazas hay que mitigar y con qué prioridad?, ¿Qué debilidad tenemos?, ¿Cuáles activos están en mayor riesgo?, ¿Cuáles son los sub-dominios y dominios de mayor riesgo?, ¿Cuál es el riesgo de cada dominio y de la\norganización?, ¿Otras relaciones importantes entre activos, debilidades y amenazas?. Se establece una relación entre Amenazas y Vulnerabilidades, el sistema (Excel) indica la magnitud del impacto que puede provocar un incidente. Resaltar que lo importante es que con independencia de que tipo de incidente ocurra, nos concentremos en la magnitud del Impacto. O sea, evaluar el impacto en los activos de la empresa.","responsible":"Ing. Orlando Herrera González Ing. Jacinto Torres Fernández \nMsc. Jacqueline Perera Morales \nIng. Yadier Rizo Torres \nIng. Dayana Cabrera Reyes","start":"2019-11-06 14:40:00","day":"6","time":"14:40","place":"Local 2"},{"id":76,"name":"CLAUSURA DEL EVENTO","description":null,"responsible":null,"start":"2019-11-06 15:00:00","day":"6","time":"15:00","place":"Teatro"}]